/*
|--------------------------------------------------------------------------
| 台灣縣市下拉選單
|--------------------------------------------------------------------------
|   TODO :
*/

$.dk_tw_citySelector = {
    version : '0.0.1',
    debug : true,
    log : function() {
        // this.debug && window.console && console.log.apply(console, arguments);
    }
};

/*
|--------------------------------------------------------------------------
| Use
|--------------------------------------------------------------------------
|   $('.wrapper').dk_tw_citySelector('.county', '.district', '.zipcode');
*/

;(function($) {
    'use strict';
    
    $.fn.dk_tw_citySelector = function(selectFirst, selectSecond, selectThird) {

        // ----------------------------------------
        // Data
        // ----------------------------------------

        var country = [
            '台北市','基隆市','新北市','宜蘭縣','新竹縣','桃園市','苗栗縣','台中市',
            '彰化縣','南投縣','嘉義縣','雲林縣','台南市','高雄市','澎湖縣',
            '屏東縣','台東縣','花蓮縣','金門縣','連江縣','南海諸島','釣魚台列嶼'
        ];

        var district =
        [
            // 台北市
            [
                [ '中正區','大同區','中山區','松山區','大安區','萬華區','信義區','士林區',
                  '北投區','內湖區','南港區','文山區' ],
                [ '100','103','104','105','106','108','110','111','112','114','115','116' ]
            ],
            // 基隆市
            [
            	[ '仁愛區','信義區','中正區','中山區','安樂區','暖暖區','七堵區' ],
                [ '200','201','202','203','204','205','206' ]
            ],
            // 新北市
            [
                [ '萬里區','金山區','板橋區','汐止區','深坑區','石碇區','瑞芳區','平溪區',
                  '雙溪區','貢寮區','新店區','坪林區','烏來區','永和區','中和區','土城區',
                  '三峽鎮','樹林區','鶯歌鎮','三重區','新莊區','泰山區','林口區','蘆洲區',
                  '五股區','八里區','淡水鎮','三芝區','石門區' ],
                [ '207','208','220','221','222','223','224','226','227','228',
                  '231','232','233','234','235','236','237','238','239','241',
                  '242','243','244','247','248','249','251','252','253' ]
            ],
            // 宜蘭縣
            [
                [ '宜蘭','頭城','礁溪','壯圍','員山','羅東','三星','大同',
                  '五結','冬山','蘇澳','南澳' ],
                [ '260','261','262','263','264','265','266','267','268','269',
                  '270','272' ]
            ],
            // 新竹市
            [
                [ '東區','竹北','湖口','新豐','新埔','關鎮','芎林','寶山',
                  '竹東','五峰','橫山','尖石','北埔','峨眉' ],
                [ '300','302','303','304','305','306','307','308','310','311',
                  '312','313','314','315' ]
            ],
            // 桃園市
            [
                [ '中壢','平鎮','龍潭','楊梅','新屋','觀音','桃園','龜山',
                  '八德','大溪','復興','大園','蘆竹' ],
                [ '320','324','325','326','327','328','330','333','334','335',
                  '336','337','338' ]
            ],
            // 苗栗縣
            [
                [ '竹南','頭份','三灣','南庄','獅潭','後龍','通霄','苑裡',
                  '苗栗','造橋','頭屋','公館','大湖','泰安',
                  '銅鑼','三義','西湖','卓蘭' ],
                [ '350','351','352','353','354','356','357','358','360','361',
                  '362','363','364','365','366','367','368','369' ]
            ],
            // 台中市
            [
                [ '中區','東區','南區','西區','北區','北屯區','西屯區','南屯區','太平區',
                  '大里區','霧峰區','烏日區','豐原區','后里區','石岡區','東勢區','和平區',
                  '新社區','潭子區','大雅區','神岡區','大肚區','沙鹿區','龍井區','梧棲區',
                  '清水區','大甲區','外埔區', '大安區' ],
                [ '400','401','402','403','404','406','407','408','411','412',
                  '413','414','420','421','422','423','424','426','427','428',
                  '429','432','433','434','435','436','437','438','439' ]
            ],
            // 彰化縣
            [
                [ '彰化','芬園','花壇','秀水','鹿港','福興','線西','和美',
                  '伸港','員林','社頭','永靖','埔心','溪湖','大村','埔鹽',
                  '田中','北斗','田尾','埤頭','溪州','竹塘','二林','大城',
                  '芳苑','二水' ],
                [ '500','502','503','504','505','506','507','508','509','510',
                  '511','512','513','514','515','516','520','521','522','523',
                  '524','525','526','527','528','530' ]
            ],
            // 南投縣
            [
                [ '南投','中寮','草屯','國姓','埔里','仁愛','名間','集集',
                  '水里','魚池','信義','竹山','鹿谷' ],
                [ '540','541','542','544','545','546','551','552','553','555',
                   '556','557','558' ]
            ],
            // 嘉義縣
            [
                [ '嘉義市','番路','梅山','竹崎','阿里山','中埔','大埔','水上',
                  '鹿草','太保','朴子','東石','六腳','新港','民雄','大林',
                  '溪口','義竹','布袋' ],
                [ '600','602','603','604','605','606','607','608','611','612',
                  '613','614','615','616','621','622','623','624','625' ]
            ],
            // 雲林縣
            [
                [ '斗南','大埤','虎尾','土庫','褒忠','東勢','台西','崙背',
                  '麥寮','斗六','林內','古坑','莿桐','西螺','二崙','北港',
                  '水林','口湖','四湖','元長' ],
                [ '630','631','632','633','634','635','636','637','638','640','643',
                  '646','647','648','649','651','652','653','654','655' ]
            ],
            // 台南市
            [
                [ '中區','東區','南區','北區','安平區','安南區','永康區','歸仁區','新化區',
                  '左鎮區','玉井區','楠西區','南化區','仁德區','關廟區','龍崎區','官田區',
                  '麻豆區','佳里區','西港區','七股區','將軍區','學甲區','北門區','新營區',
                  '後壁區','白河區','東山區','六甲區','下營區','柳營區','鹽水區','善化區',
                  '大內區','山上區','新市區','安定區' ],
                [ '700','701','702','704','708','709','710','711','712','713','714',
                  '715','716','717','718','719','720','721','722','723','724','725',
                  '726','727','730','731','732','733','734','735','736','737','741',
                  '742','743','744','745' ]
            ],
            // 高雄市
            [
                [ '新興區','前金區','苓雅區','鹽埕區','鼓山區','旗津區','前鎮區','三民區',
                  '楠梓區','小港區','左營區','仁武區','大社區','岡山區','路竹區','阿蓮區',
                  '田寮區','燕巢區','橋頭區','梓官區','彌陀區','永安區','湖內區','鳳山市',
                  '大寮區','林園區','鳥松區','大樹區','旗山區','美濃區','六龜區','內門區',
                  '杉林區','甲仙區','桃源區','三民區','茂林','茄萣' ],
                [ '800','801','802','803','804','805','806','807','811','812','813',
                  '814','815','820','821','822','823','824','825','826','827','828',
                  '829','830','831','832','833','840','842','843','844','845','846',
                  '847','848','849','851','852' ]
            ],
            // 澎湖縣
            [
                [ '馬公','西嶼','望安','七美','白沙','湖西' ],
                [ '880','881','882','883','884','885' ]
            ],
            // 屏東縣
            [
                [ '屏東','三地門','霧台','瑪家','九如','里港','高樹','鹽埔',
                  '長治','麟洛','竹田','內埔','萬丹','潮州','泰武','來義',
                  '萬巒','崁頂','新埤','南州','林邊','東港','琉球','佳冬',
                  '新園','枋寮','枋山','春日','獅子','車城','牡丹','恆春',
                  '滿州' ],
                [ '900','901','902','903','904','905','906','907','908','909','911',
                  '912','913','920','921','922','923','924','925','926','927','928',
                  '929','931','932','940','941','942','943','944','945','946','947' ]
            ],
            // 台東縣
            [
                [ '台東','綠島','蘭嶼','延平','卑南','鹿野','關山','海端',
                  '池上','東河','成功','長濱','太麻里','金峰','大武','達仁' ],
                [ '950','951','952','953','954','955','956','957','958','959','961',
                  '962','963','964','965','966' ]
            ],
            // 花蓮縣
            [
                [ '花蓮','新城','秀林','吉安','壽豐','鳳林','光復','豐濱',
                  '瑞穗','萬榮','玉里','卓溪','富里' ],
                [ '970','971','972','973','974','975','976','977','978','979','981',
                  '982','983' ]
            ],
            // 金門縣
            [
                [ '金沙','金湖','金寧','金城','烈嶼','烏坵' ],
                [ '890','891','892','893','894','896' ]
            ],
            // 連江縣
            [
                [ '南竿','北竿','莒光','東引' ],
                [ '209','210','211','212' ]
            ],
            // 南海諸島
            [
                [ '東沙','南沙' ],
                [ '817','819' ]
            ],
            // 釣魚台列嶼
            [
                [ '釣魚台列嶼' ],
                [ '290' ]
            ]
        ];


        // ----------------------------------------
        // Settings
        // ----------------------------------------

        var $wrapper = this,
            $selectFirst = $(selectFirst, $wrapper),
            $selectSecond = $(selectSecond, $wrapper),
            $selectThird = $(selectThird, $wrapper),
            selectFirstPrepend = '<option value="">選擇縣市</option>',
            selectSecondPrepend = '<option value="">---</option>',
            selectCustom = $selectFirst.data('custom');


        // ----------------------------------------
        // Constructor
        // ----------------------------------------

        function Selector() {
            this.init();
            this.countryChange();
            this.districtChange();
            this.selected($selectFirst);
            this.selected($selectSecond);
        }


        // ----------------------------------------
        // Init
        // ----------------------------------------
        
        Selector.prototype.init = function() {
            // 縣市選項內容
            // ==========
            var firstSelectOption = selectFirstPrepend,
                custom = false;
            
            if (selectCustom !== undefined) {
            // 若指定顯示縣市
                custom = selectCustom.replace(/\s/g, ''); // 去除空白字元
                custom = custom.split(','); // 轉陣列                
            }

            for (var i = 0, j = country.length; i < j; i++) {

                if ( typeof custom === 'object' && $.inArray( country[i], custom ) === -1 ) {
                    // 因為ie8不支援 Array indexOf() Method，使用 $.inArray 替代處理
                    continue;
                }

                // <option value="台北市" data-order="0">台北市</option>
                firstSelectOption += '<option value="'+ country[i] +'" data-order="'+ i +'">'+ country[i] +'</option>';
            }

            $selectFirst.prepend(firstSelectOption);

            // 區域選項內容
            // ==========
            $selectSecond.prepend(selectSecondPrepend);
        };


        // ----------------------------------------
        // countryChange
        // ----------------------------------------
        
        Selector.prototype.countryChange = function() {
            var self = this;

            // 縣市選單動作
            // ==========
            $selectFirst.change(function() {
                var order = $('option:selected', this).data('order');

                if (order !== undefined) { // 選擇有值的選項
                    $selectSecond.prepend('<option value="">選擇區域</option>');
                    $selectSecond.find('option:gt(0)').remove();
                    
                    // 產生第二選單的選項內容
                    for(var i = 0, j = district[order][0].length - 1; i <= j; i++) {
                        // <option value="中正區" data-zip="100">中正區</option>
                        $selectSecond.append('<option value="'+ district[order][0][i] +'" data-zip="'+ district[order][1][i] +'">'+ district[order][0][i] +'</option>');
                    }

                    $selectSecond.find('option:eq(0)').attr('selected', 'selected');
                } else {
                    self.reset();
                }

                $selectThird.val('');
            });
        };


        // ----------------------------------------
        // districtChange
        // ----------------------------------------
        
        Selector.prototype.districtChange = function() {
            // 區域選單動作 
            $selectSecond.on('change', function() {
                var zip = $('option:selected', this).data('zip');
                $selectThird.val(zip);
            });
        };


        // ----------------------------------------
        // selected
        // ----------------------------------------
        
        Selector.prototype.selected = function($ele) {
            // 選單選定
            // ==========
            var selected = $ele.data('selected');
            
            if (selected !== undefined) {
                $ele.val(selected).trigger('change');
                return;
            }
        };


        // ----------------------------------------
        // reset
        // ----------------------------------------
        
        Selector.prototype.reset = function() {
            // 回復預設
            $selectSecond.prepend(selectSecondPrepend);
            $selectSecond.find('option:gt(0)').remove();
        };


        // ----------------------------------------
        // Handler
        // ----------------------------------------

        this.each(function() {
            this.dkSelector = new Selector();
        });

        return this;

    };

})(jQuery);